Tekla Open API Reference for Tekla Structures 2025
CatalogHandler.GetUserPropertyItems Method
Overload List
Name | Description
GetUserPropertyItems()
 Returns an enumerator of all user property items.
GetUserPropertyItems(CatalogObjectTypeEnum)
 Returns an enumerator of user property items of the given object type.
Top
See Also
Reference
CatalogHandler Class
Tekla.Structures.Catalogs Namespace